In [2]:
!pip3 install mysql-connector-python

Requirement already satisfied: mysql-connector-python in /Library/Frameworks/Python.framework/Versions/3.9/lib/python3.9/site-packages (8.3.0)
WARNING: You are using pip version 20.2.3; however, version 24.0 is available.
You should consider upgrading via the '/Library/Frameworks/Python.framework/Versions/3.9/bin/python3.9 -m pip install --upgrade pip' command.

In [3]:
import mysql.connector

In [11]:
mydb = mysql.connector.connect(host = 'localhost',
                               user = 'root',
                               password = '725@Mysql')
print(mydb.connection_id)

14

In [12]:
cur = mydb.cursor()

In [13]:
cur.execute("show databases")

In [14]:
for dbs in cur:
    print(dbs)

('CompanyDB',)
('cx_db',)
('db1',)
('db2',)
('db3',)
('f_db1',)
('f_db2',)
('idb1',)
('idb2',)
('idb3',)
('idb4',)
('idb5',)
('information_schema',)
('mydb',)
('mydb_emp',)
('mydbx',)
('mysql',)
('mysql_db',)
('performance_schema',)
('sys',)

In [15]:
cur.execute("create database mynewdb")
print("mynewdbcreated")

mynewdbcreated

In [16]:
cur.execute("show databases")

In [17]:
for dbs in cur:
    print(dbs)

('CompanyDB',)
('cx_db',)
('db1',)
('db2',)
('db3',)
('f_db1',)
('f_db2',)
('idb1',)
('idb2',)
('idb3',)
('idb4',)
('idb5',)
('information_schema',)
('mydb',)
('mydb_emp',)
('mydbx',)
('mynewdb',)
('mysql',)
('mysql_db',)
('performance_schema',)
('sys',)

In [18]:
#server => database => data table

mydb = mysql.connector.connect(host = "localhost",
                              user = "root",
                              password = "725@Mysql",
                              database = "mynewdb")
cur = mydb.cursor()

In [19]:
s = "create table newbook(bookid int(4) , title varchar(20) , price float(5,2))"
cur.execute(s)
mydb.commit()
print("Data table Newbook is created in mynewdb to store data")

Data table Newbook is created in mynewdb to store data

In [20]:
s = "show tables"
cur.execute(s)
for table in cur:
    print(table)

('newbook',)

In [24]:
s = "insert into newbook (bookid,title,price) values(%s,%s,%s)"
value = (2,"HTML",150)
cur.execute(s,value)
print("value added into table")

value added into table

In [25]:
s = "select * from newbook"
cur.execute(s)
for row in cur:
    print(row)

(1, 'Python', 200.0)
(2, 'HTML', 150.0)

In [26]:
s = "insert into newbook (bookid,title,price) values (%s,%s,%s)"
value = [(3,"PHP",150),(4,"Java",100),(5,"Scala",160)]
cur.executemany(s,value)
print("Multiple values are added successfully")

Multiple values are added successfully

In [27]:
s = "select * from newbook"
cur.execute(s)
for row in cur:
    print(row)

(1, 'Python', 200.0)
(2, 'HTML', 150.0)
(3, 'PHP', 150.0)
(4, 'Java', 100.0)
(5, 'Scala', 160.0)

In [28]:
s = "select * from newbook"
cur.execute(s)
result = cur.fetchall()
print(result)

[(1, 'Python', 200.0), (2, 'HTML', 150.0), (3, 'PHP', 150.0), (4, 'Java', 100.0), (5, 'Scala', 160.0)]

In [29]:
s = "select * from newbook"
cur.execute(s)
result = cur.fetchall()
for res in result:
    print(res)

(1, 'Python', 200.0)
(2, 'HTML', 150.0)
(3, 'PHP', 150.0)
(4, 'Java', 100.0)
(5, 'Scala', 160.0)

In [30]:
#write a query to increase price by 10

s = "update newbook set price = price + 10"
cur.execute(s)
print("Price values are updated")

Price values are updated

In [31]:
s = "select * from newbook"
cur.execute(s)
result = cur.fetchall()
print(result)

[(1, 'Python', 210.0), (2, 'HTML', 160.0), (3, 'PHP', 160.0), (4, 'Java', 110.0), (5, 'Scala', 170.0)]

In [32]:
#write a query to decrease price by 10% where it is more then 200

s = "update newbook set price = price * 0.9 where price > 200"
cur.execute(s)
print("Price values are updated")

Price values are updated

In [33]:
s = "select * from newbook"
cur.execute(s)
result = cur.fetchall()
print(result)

[(1, 'Python', 189.0), (2, 'HTML', 160.0), (3, 'PHP', 160.0), (4, 'Java', 110.0), (5, 'Scala', 170.0)]

In [36]:
#write a query to delete data sample representing "Scala"

s = "delete from newbook where title = 'Scala'"
cur.execute(s)
print("Sample Scala is deleted")

Sample Scala is deleted

In [37]:
s = "select * from newbook"
cur.execute(s)
result = cur.fetchall()
print(result)

[(1, 'Python', 189.0), (2, 'HTML', 160.0), (3, 'PHP', 160.0)]

In [38]:
s = "insert into newbook (bookid,title,price) values (%s,%s,%s)"
values = [(3,'PHP',160),(3,'PHP',160)]
cur.executemany(s,values)

In [39]:
s = "select * from newbook"
cur.execute(s)
result = cur.fetchall()
print(result)

[(1, 'Python', 189.0), (2, 'HTML', 160.0), (3, 'PHP', 160.0), (3, 'PHP', 160.0), (3, 'PHP', 160.0)]

In [40]:
#create a table newbook2 with all the values of newbook i.e. a copy of newbook

s = "create table newbook2 as select * from newbook"
cur.execute(s)

In [41]:
s = "select * from newbook2"
cur.execute(s)
result = cur.fetchall()
print(result)

[(1, 'Python', 189.0), (2, 'HTML', 160.0), (3, 'PHP', 160.0), (3, 'PHP', 160.0), (3, 'PHP', 160.0)]

In [46]:
#create a table newbook3 with non repetitive values of newbook

s = "create table newbook3 as select distinct bookid,title,price from newbook"
cur.execute(s)

In [47]:
s = "select * from newbook3"
cur.execute(s)
result = cur.fetchall()
print(result)

[(1, 'Python', 189.0), (2, 'HTML', 160.0), (3, 'PHP', 160.0)]

In [48]:
s = "show tables"
cur.execute(s)
for table in cur:
    print(table)

('newbook',)
('newbook2',)
('newbook3',)

In [49]:
#write a query to delete table newbook2
s = "drop table newbook2"
cur.execute(s)

In [51]:
s = "show tables"
cur.execute(s)
for table in cur:
    print(table)

('newbook',)
('newbook3',)

In [53]:
#write a query to add a new coluwm quantity as integer value

s = "alter table newbook add column quantity int(4)"
cur.execute(s)
print('quanity column is added')

quanity column is added

In [55]:
s = "describe newbook"
cur.execute(s)

In [56]:
for cols in cur:
    print(cols)

('bookid', 'int', 'YES', '', None, '')
('title', 'varchar(20)', 'YES', '', None, '')
('price', 'float(5,2)', 'YES', '', None, '')
('quantity', 'int', 'YES', '', None, '')

In [57]:
s = "select * from newbook"
cur.execute(s)
result = cur.fetchall()
print(result)

[(1, 'Python', 189.0, None), (2, 'HTML', 160.0, None), (3, 'PHP', 160.0, None), (3, 'PHP', 160.0, None), (3, 'PHP', 160.0, None)]

In [58]:
#add a new column between price and quantity

s = "alter table newbook add column sales float(7,2) after price"
cur.execute(s)

In [60]:
s = "describe newbook"
cur.execute(s)

for cols in cur:
    print(cols)

('bookid', 'int', 'YES', '', None, '')
('title', 'varchar(20)', 'YES', '', None, '')
('price', 'float(5,2)', 'YES', '', None, '')
('sales', 'float(7,2)', 'YES', '', None, '')
('quantity', 'int', 'YES', '', None, '')

In [61]:
s = "select * from newbook"
cur.execute(s)
result = cur.fetchall()
print(result)

[(1, 'Python', 189.0, None, None), (2, 'HTML', 160.0, None, None), (3, 'PHP', 160.0, None, None), (3, 'PHP', 160.0, None, None), (3, 'PHP', 160.0, None, None)]

In [62]:
#add a new column skuid as first column

s = "alter table newbook add column skuid int first"
cur.execute(s)

In [63]:
s = "describe newbook"
cur.execute(s)

for cols in cur:
    print(cols)

('skuid', 'int', 'YES', '', None, '')
('bookid', 'int', 'YES', '', None, '')
('title', 'varchar(20)', 'YES', '', None, '')
('price', 'float(5,2)', 'YES', '', None, '')
('sales', 'float(7,2)', 'YES', '', None, '')
('quantity', 'int', 'YES', '', None, '')

In [64]:
s = "select * from newbook"
cur.execute(s)
result = cur.fetchall()
print(result)

[(None, 1, 'Python', 189.0, None, None), (None, 2, 'HTML', 160.0, None, None), (None, 3, 'PHP', 160.0, None, None), (None, 3, 'PHP', 160.0, None, None), (None, 3, 'PHP', 160.0, None, None)]

In [65]:
#delete the column bookid

s = "alter table newbook drop column bookid"
cur.execute(s)

In [66]:
s = "describe newbook"
cur.execute(s)

for cols in cur:
    print(cols)

('skuid', 'int', 'YES', '', None, '')
('title', 'varchar(20)', 'YES', '', None, '')
('price', 'float(5,2)', 'YES', '', None, '')
('sales', 'float(7,2)', 'YES', '', None, '')
('quantity', 'int', 'YES', '', None, '')

In [ ]:
#insert a new data sample

s = "insert into newbook (skuid,title,price,sales,quantity) values (4,'C++',130,20000,)"